Revit 2027 API
MultiServerService.GetActiveServerIds Method
Overload List
Name | Description
GetActiveServerIds() |  Returns Ids of the currently active application-level servers registered for the service.
GetActiveServerIds(Document) |  Returns Ids of the servers currently applicable to the given document for the service.
Top
See Also
Reference
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace